[{"title": "O Mine Enemy", "author": "Kirby Lane", "text": "Harry finds an injured Snape on his doorstep and must hide him from the Dursleys. To complicate matters, a series of strange dreams portends a frightening future unless the two can find a way to work together. A mentor story. Alternate 6th summer: post-OotP; ignores HBP & DH."}, {"title": "The Gilded Snake", "author": "Lorde Shadowz", "text": "The war is over, at great cost, and Severus Snape goes back to change things. If only it were that simple...AU second year; warning, Snape comes from a slightly different future than canon. Slight, mostly implied Bill Severus slash. Don't like, don't read."}, {"title": "Pretending to Hate", "author": "TabithaHallows", "text": "Valentine Lestrange is the only child of Bellatrix and Rodolphus Lestrange. When they're are sentenced to life in Azkaban, Valentine is placed into the care of the Malfoys. She couldn't have imagined what would become of the day when she is approached by Dumbledore himself. That day changed her life and gave her a purpose that became her greatest secret."}, {"title": "To Do Something", "author": "HyperFire16", "text": "Drabble: Roger Davies and Cho Chang after the third task."}, {"title": "Marauders - Back in Time, Time is Back - Book 1", "author": "Alice1420", "text": "The marauders are lazing around one morning and discover a mysterious book that's from the future. Sirius decides to be stupid and put it on his head. They end up in 1993, and things are getting weird. Lily/James Co-written with James Potter2833 (Ichigo Briefs)"}, {"title": "sins of the father", "author": "immortalsorcerer", "text": "M&MWP, oneshot, slash. There is an unmistakable quirk flowing in the veins of Orion Black. Naturally, his sons inherit it. .::Regulus-centric Regideon; for hprarepairnet on tumblr::."}, {"title": "New Blood", "author": "Numbuh10-4", "text": "Clasificada en Slytherin con el susurro de la profecía a su alrededor, Hermione se niega a inclinarse ante los prejuicios de sangre que envenenan el mundo mágico. Siguiendo su propio camino, Hermione decide hacer su propio destino, no como muggle, ni mestizo, ni como sangre pura ... sino como sangre nueva, y todo lo que significa el término misterioso."}, {"title": "The seemingly insignificant problem", "author": "emmaxmalfoy13", "text": "Sometimes a problem is very big and sometimes it seems insignificant. When Hermione's body starts to change gradually, she becomes worried about what is happening to her, yet Albus Dumbledore says it's nothing but a sign of magical puberty. Is it though?"}, {"title": "Power plays", "author": "hemerocallis", "text": "What if the abuse hardened Harry instead of braking him. Slytherin, grey, smarter, defensive Harry. Arrogant Snape. Crazy manipulative Dumbledore."}, {"title": "Wildest Dreams", "author": "Tempest Kiro", "text": "Draco Malfoy thought he would never escape his dark past until one afternoon when he receives a letter from Saint Potter proving him wrong."}, {"title": "Harry Potter Finally Graduates Book V -- Ginny's Quest Continues", "author": "Liya249", "text": "While Ginny continues her dangerous Quest, on behalf of Odin, newly sworn-in Minister of Magic Harry Potter must face new challenges in Wizard Britain. Ginny and Hermione slowly learn the true purpose for their Quest."}, {"title": "The Peace Not Promised", "author": "edwinguerrave", "text": "His life had been a mockery to itself, as too his death it seemed. For what kind of twisted humour would force Severus Snape to relive his greatest regret? To return him to the point in his life when the only person that ever mattered in his life had already turned away."}, {"title": "Death is not the End", "author": "MoonytheMarauder1", "text": "All is lost, Voldermort won. So why does Hermione Granger wake to find herself years before the events of the Second Wizarding War with all the memories of taking part in it. Time travel but not really."}, {"title": "Harry Potter y la Frontera Final (2da Edición)", "author": "Rovia2323", "text": "Harry Potter ha derrotado al Señor Tenebroso... Pero, ¿qué les depara a Harry, sus amigos y al resto del mundo mágico en este primer año sin Voldemort? ¿Se acabaron las aventuras, problemas y riesgos? No, al menos es lo que yo espero... SEGUNDA EDICiÓN, corregida y aumentada!"}, {"title": "This Is Our Time", "author": "Darkw01fie", "text": "A collection of gift-fics (mostly from Hogwarts' Gift-Tag). Current: After a sudden storm hits, Hannah rushes into a nearby cafe, where she meets someone who immediately catches her interest. NevilleHannah coffeeshop!au For Amanda / Death Eaters come for Rosmerta, but Kingsley arrives in the nick of time. KingsleyRosmerta. For Audrey"}]