[{"title": "Wild Magic", "author": "Artemisdesari", "text": "Ravens are large birds and this raven is bigger still, perhaps a little more than two and a half feet long which could be considered a considerable size to a hobbit of only three feet and eight inches. For Billana Baggins, outcast and feared for her strange magic, this raven could signal that start of a new life, provided she survives the journey towards it."}, {"title": "Mistaken Identity", "author": "ThatOtherWriterGirl", "text": "Fili didn't want an arranged marriage. Neither did Réann. Yet, here she was, in Erebor, waiting to be presented to the Crown Prince along with the other candidates. Yet, when Fili and Réann happen to meet quite by accident…that's when all kinds of trouble arises. But what does one expect from the Sons of Durin?"}, {"title": "Stars Still Shine Without You", "author": "pinksnowdevil", "text": "The fairy tale of their love seemed so much nicer than the reality of it. Their lives existed so much without the other that they felt more apart than before they were married."}, {"title": "Benders: Dragonfire", "author": "Jaya Avendel", "text": "In a breath, he had bloodied Legolas and infuriated Thranduil. In a breath, he knew pride and hatred. In a breath, Thorin Oakenshield knew an elf would walk beside him, that he would face Smaug with the most unlikely of friends, and perhaps not walk from Erebor with the Arkenstone in his hands. In a breath, he knew dragonfire. Fourth in Benders."}, {"title": "Faith", "author": "Luinwen-2013", "text": "AU where the heirs of Durin survive BoFA. Kíli rules the Blue Mountains, now only a shadow of what it was before the Retake of Erebor, where Thorin is king and Fíli is crown prince, both of whom he misses dearly, but someone has to take charge of the settlement. Things are bad enough, but get worse – Kíli is summoned to Erebor to perform his duty as a spare and marry a princess."}, {"title": "Blink Of An Eye", "author": "Faron Oakenshield", "text": "Thranduil pays Bard a visit in Dale, and they discuss life and matters of the heart."}, {"title": "A Whole New World (REDONE)", "author": "Bindi-the-skunk", "text": "Sophia never dreamed other worlds were possible, thinking them to be nothing more than just stories. That is until she and her boy, Aiden, find themselves in Middle Earth. Follow their story as they join up with a bunch of dwarves, trying to get home. Will the two find their way into our world, or will they create a new home with a new family? Thorin/OC"}, {"title": "All I ever wanted all I ever needed", "author": "Furby123", "text": "Bilbo dies, but is sent to an alternate world that has everything he could ever want or need MPREG warning and some drama later on"}, {"title": "Love has two sides", "author": "153alira", "text": "Brine looked at him with fear in her eyes. Luckily, her false beard hid the pallor of her face. \"I don't know what you're talking about, Fili.\" Fili looked at her with a strange shadow in his eyes. \"You have to tell him the truth, Pip.\" One more look was enough to confirm Brine's suspicions. Fili knew who she really was. -I'll try to update every Wednesday-"}, {"title": "Looking back, Moving Foward", "author": "Vannen Shantel", "text": "Baggins are respectable folk, even Marie is considered so. But such things are soon thrown out the door when a wizard arrives on her doorstep and 13 dwarves raid her pantry. Childhood dreams that turned to bittersweet memories can be healed, but what has a king got to do with it?"}, {"title": "Marriage of Necessity", "author": "PokeMaster389", "text": "In a desperate attempt to make sure someone he trusts rules over Erebor, Thorin marries Bilbo on what will probably be his deathbed, as well as that of his heirs. When all three Durins survive, Thorin's marriage to Bilbo comes under scrutiny. Not everyone is happy with it."}, {"title": "Love's Adventure", "author": "bharrison1996", "text": "Thorin Oakenshield/OC love story. Ilana Baggins has always dreamed of going on an adventure to see beyond the land of Hobbiton. One day something unexpected happens to Bilbo and Ilana Baggins and Ilana's life is changed."}, {"title": "Modern Girl in Middle Earth", "author": "Venomis", "text": "Julia had a fairly good life. She was soon to be finishing her first year as a student nurse and she lived with her mum and dad who loved her. But when a huge thunderstorm hits England, she somehow is confronted with orcs, wargs, dwarves, a hobbit and a wizard. To add to her troubles, no one seems to be able to understand her. Constructive criticism welcomed."}, {"title": "So Far Away", "author": "Therightshadeofblue", "text": "Dís and Thorin lose everything when their army fails to reclaim Moria from the orcs. Looking for shelter, they end up in a beautiful place. When Thorin leaves his sister and little nephews behind to search for his father, Dís faces a devilish dilemma: she has to choose between the safety of her sons and the well-being of the people that took care of them. (Pre-Hobbit setting)"}, {"title": "Wanderer Above the Sea of Mist", "author": "lindir's gaze", "text": "The Orion were a race of warriors created by the Elves to rid Middle Earth of the deadly plague of the Orc. After a deadly massacre Mikal is the last living Orion and wants nothing more than to cultivate her quiet life and have tea with her dear friend Bilbo Baggins. When a troupe of adventurous Dwarves find their way into the Shire-Mikal cannot ignore the call for adventure."}]