[{"title": "Canis Canem Edit", "author": "Golden Moon Huntress", "text": "Oh, you think the darkness is your ally, you merely adopted the dark. We were born in it, moulded by it. We didn't see the light until we were beyond childhood; by then, it was nothing to us but blinding! Partial SYOT, closed!"}, {"title": "Sub Dio", "author": "LadyCordeliaStuart", "text": "Seventy Five years of the Hunger Games have passed, and now we celebrate the Third Quarter Quell. AU!"}, {"title": "Descent Into Madness: The Fifty-Seventh Hunger Games", "author": "Professor R.J Lupin1", "text": "SYOT full but I DO often get dropouts so I have a list of people who were interested but missed out."}, {"title": "Live Die Repeat", "author": "TheEngineeringGames", "text": "Legend Lepidus, a tired boy from District 5, honestly doesn't care that he's been reaped. If he dies, so what? Dying is fine. And die is what he does - his head topples to the ground fifteen seconds into the Games. Suddenly, Legend finds himself back on the train, alive and well. He's about to find out just how much he has to live for. An open, rather unconventional partial SYOT."}, {"title": "Senseless: The Sixth Quarter Quell", "author": "66samvr", "text": "After the tumultuous 149th Hunger Games, excitement for the Sixth Quarter Quell has reached a peak. But with a population starting to grow restless, will the Quarter Quell succeed? Or will everyone involved become senseless?"}, {"title": "Ashes of Snow and Ice", "author": "spaceMars", "text": "24 tributes, all voted into the games by their fellow district members. They’re thrown into a arena where nothing is as it seems, and the ultimite choice is shown, kill or be killed. Does your tribute have what it takes to survive? Or will unknown twists be the pit of their despise? In the ultimite show down between Brain and Brawn, who will become the soul survivor...Open SYOT."}, {"title": "Too Much Heaven: The 9th Hunger Games", "author": "reviews", "text": "\"Nobody gets too much heaven no more. It's much harder to come by. I'm waiting in line.\""}, {"title": "We Don't Need Another Hero", "author": "jhuniemarieilarde", "text": "We don't need another hero, We don't need to know the way home"}, {"title": "The Runaway Bride", "author": "Lea Valdez", "text": "When Effie Trinket runs away in the middle of her own wedding (blame it all on wedding jitters!) and jumps into the car of a stranger with two little girls on the backseat, she doesn't know just how far the hitched ride will take her... (hayffie)"}, {"title": "Rabbit Hole", "author": "chthonic python", "text": "The boy is observant though and too clever for his own good. He knows Effie barely eats. She doesn't sleep as well and when she does, she sleeps so deep nothing can really wake her up. When she opens her eyes, she's almost out of it. He knows it all but he keeps it to himself. He lets her pretend not for his sake but for hers. SET AFTER MJ pt. 2. Peeta took Effie back to Twelve."}, {"title": "Sacrifice", "author": "DaughteroftheOneTrueKing", "text": "[FINNICK ODAIR x OC] One Hunger Games was enough to drive me mad, leave me with enough awful memories for a lifetime, leave enough scars on my body. But the Third Quarter Quell announcement ruined the little sense of security I had left after walking out of the bloody arena. I had to go back in. This time, with people I knew and loved."}, {"title": "The 61st Hunger Games: The Reckoning", "author": "Galeniss Everlark", "text": "These Games won't go easy on either side of the screen. To keep their tributes alive and navigate the brewing sea of treachery in the corners and ballrooms of the Capitol, the mentors will need to dig deep into every resource they've worked for, and most importantly, trust nobody. Submit Your Own Mentor [Open]."}, {"title": "In Absentia: The 53rd Hunger Games", "author": "Darthdestiny", "text": "With boredom growing in the Capitol after the Quarter Quell, the 53rd Games are being touted as the best the Capitol the has to offer."}, {"title": "The Hunger Gays", "author": "spobywinchester", "text": "Every year, a gay and lesbian is chosen from each district to participate in The Hunger Games, an event where kids from the ages of twelve and eighteen must fight to the death."}, {"title": "The 150th Hunger games: Bloodlust", "author": "A River Of Ink", "text": "The second rebellion failed and after some time district 12 came back to the hunger games at the 4th quarter quell. Now as the 6th quarter quell is coming up us it is time to recall district 13! Who will win? SYOT open."}]