[{"title": "What It Means To Be A King", "author": "Arinariel", "text": "No one is born great and wise, not even the great King Gil-galad or Master Elrond, known throughout Middle Earth for his wisdom and knowledge. For young Thranduil, the road toward wisdom and greatness is fraught with deep-seated anger, sorrow and remorse. This is a journey through the Second Age seen through the eyes of Thranduil, Gil-galad, Elrond and Sauron."}, {"title": "Frodon, Sam et l'Anneau", "author": "merida12.mulan98", "text": "L'histoire de fantasy la plus culte de tous les temps mais où Sam n'est pas Samsagace mais Samelia (le e se prononce é) (reprise de mon ancien compte Eris0 actuellement perdu)"}, {"title": "The Knight before Mettarë", "author": "annafan", "text": "AU silliness, loosely based on that made-for-TV gem, \"The Knight Before Christmas\". A Christmas present for Sian. Do not expect anything profound, or indeed anything other than complete crackfic."}, {"title": "Maidens of Rohan", "author": "the8horcrux", "text": "Arawin, a sixteen year old girl living in a small village in Rohan, never suspected that the darkness would reach her. But it did, and now her town is all but destroyed. Now she and her little sister must deliver a message to King Theoden about its fate. Along the way, she discovers that her heritage is much more complicated than she knew. Extended Summary Inside."}, {"title": "Frodo's Cooking Skills", "author": "Aria Breuer", "text": "Frodo puts his cooking skills to the test."}, {"title": "Duty and Desire", "author": "AmandaBaker852", "text": "While in Minas Tirith to attend the coronation of Aragorn, Eomer signs a contract that will change the future of his life and his kingdom. Eomer/OC. AU. Part 1 of the Quills and Swords series."}, {"title": "L'oubliée", "author": "Melior Silverdjane", "text": "Elle alla dans un monde dont elle avait seulement rêvé, devint ce qu'elle rêvait d'être, et maintenant…"}, {"title": "Lord Elrond, Tickle Master!", "author": "reviews", "text": "Thranduil's little princess has been rather sassy, thinking she can get away with saying mischievous things to our stern elf lord without retaliation. Elrond may look deadly serious, but don't let that fool you!"}, {"title": "Crazy Rich Elves", "author": "freetumnus", "text": "Eldalótë, a brilliant tactician from Lothlorien has many accomplishments to her name. She was pivotal in the victory on the Pelennor Fields, aided in the survival of the Rohan forces in Helm's Deep, and had managed to capture the love of Legolas. However, this is nothing compared to the task ahead of her: meeting Legolas's crazy, rich, royal family. Fun fluff [Legolas, OC]."}, {"title": "Edaid", "author": "sian22", "text": "Edaid *Sindarin, a double, a pattern or mirror of another. A dream, echoed where least expected, leads Faramir and Imrahil on a search down through the waves of time for a long lost family member."}, {"title": "A Beautiful Nightmare", "author": "Something Terribly Clever", "text": "Tabi's family has been hunted by Sauron for generations after her great grandmother defied him in her ignorance for the world. All goes wrong when Saruman finds the books written by a fellow named Tolkien. Tabi is forced to go along on the journey keeping what remains of the story in tact. Creating further enemies than those that hunt the Ring and her family."}, {"title": "Naked Greenleaf", "author": "Nadiafarjana", "text": "Dear Eru,we have not only lost the prince,we have lost the naked prince. The king will be furious."}, {"title": "This I Know, and I Would Follow You", "author": "reviews", "text": "The Fellowship is setting out on its trek across Middle Earth to destroy the One Ring. But with death, fear and love battering at the fragile bonds between members, it seems like the Quest may be doomed to fail. Slow burn Aragorn x Legolas"}, {"title": "A Face in the Crowd", "author": "Singingsprite", "text": "The war of the Ring brings new friends to Keren, a healer of Minas Tirith, including a strange elf. How will they shape her future? Join her on a journey of self-discovery and romance! Begins in ROTK. 'This has got to be one of the most developed and well written fanfictions online' - hopAdaisy 'I've never cared so much about an OC character before' - TheRoadtoHell666"}, {"title": "The Girl in the Greenwood", "author": "L. Elizabeth1", "text": "Chosen by the Valar for an unknown purpose, a young woman finds herself in the realm of the Elvenking. (More summary to come when I get further along)."}]