[{"title": "Reunion And So On", "author": "Clarise Lights", "text": "20 years they waited to see each other again. No communication between them. Complete radio silence. They live separate lives while staying in touch with The Flock. If they get their reunion, then what comes after that? Rated T due to gore and violence later on (and of course FAX fluff)."}, {"title": "The Valkyrie Experiment", "author": "ILoveMe297", "text": "The flock never left the School. Jeb tried to rescue them, but he failed. Max is eighteen now and she hasn't seen the rest of the flock in years after the whitecoats separated them. Itex gives her an offer, one that she never expected—they want her to join the company. Will Max believe that they want to save the world? Will she find her flock again? [AU] [Wings]"}, {"title": "Critical Condition", "author": "DJmiso", "text": "I looked out towards Fang as he stood about 25 feet away from us. The rain water dripped off his dark hair and down his soaked body, but he stayed out there, keeping watch. He slowly extended one wing, testing the wind lightly. He then extended the other wing. I watched as he then jumped into the air and unfurled his wings out hard, the wind snatching him up instantly."}, {"title": "Hawk Eyes", "author": "reviews", "text": "Seen from a bird’s eye view. [revised] [M/F]"}, {"title": "Found Family", "author": "thestupidgenius1123", "text": "\"...the breeze was coming from the direction of the apple orchard, so it carried a pleasant, sweet scent with it. Even though it was the middle of the night, probably around 3:00 AM, I was plenty warm under the fuzzy blanket I had pulled tightly around me. Such an idyllic, heavenly place to be. So why was I crying?\" [OneShot] [Mid-School's Out—Forever]"}, {"title": "Repercussions", "author": "Katie Woods", "text": "\"I sigh and roll my neck, still feeling his hot gaze on me, unmoving from across the kitchen counter. I know he knows that I'm so not okay, I know that he just wants to help. But I'm tired of waiting for help and I'm so tired of doing this.\" TRIGGERS AND LANGUAGE. 5 years Post-MAX. AU. Rated T."}, {"title": "Huntress", "author": "staphylococci", "text": "Crater is a crazy eraser with nowhere to go. Nowhere but up that is. Yep, Crater's the first flying eraser of the lot. But she's not exactly the best at what she does. She protects her home turf New York City but when Max and her flock come in causing trouble..."}, {"title": "Like Lions", "author": "Jenava293", "text": "When their new home in the forest is discovered by Erasers, Max and the flock are given a message: the answer lies north. Trouble is, they're unsure of the question. Guided by Max's Voice, some clues, and Iggy's highly developed sense of irony, they head north in search for the one thing they desperately need but have never truly had: freedom. [Post-SOF]"}, {"title": "A Normal Life Just Can't Stay", "author": "trilogiesrule", "text": "Fang: A jock and person who can get any girl. Except for Max, it seems. Max: A girl who has been trying to disappear for 6 years and who hates Fang with all her heart. What will happen when these two finally meet? Rated T"}, {"title": "The Flock Goes to School", "author": "AbbySux", "text": "Itex and The School finally defeated, the Flock is left trying to live a normal life with Dr. Martinez and Ella. Mainly, they have to go to school. Triggers of Max's bad memories prove that school isn't as harmless as she originally thought. Rated T because I'm not sure what I'll enter in the future. FAX, but not story consuming and no/minor make out sessions."}, {"title": "Tara Sux", "author": "S. Kaecilynn", "text": "Maya and Max are twin sisters who have just moved from New York to California. As they adjust to new everythings, Maya forces Max to help her get to know a certain tall, dark, and silent boy. But will Max and Fang fall for each other instead? FAXFAXFAX!"}, {"title": "Beneath Those Walls", "author": "reviews", "text": "Max and her sisters, Nudge and Ella, move from sunny California to dry Arizona searching for a new life. New friends and enemies are made, and secrets are uncovered. She's sassy, rude, sarcastic, and badass. But when a gorgeous dark-haired boy comes along and breaks down her walls, can she open up and finally let herself go? Or will she push him aside like everyone else? All Human"}, {"title": "Christmas Eve Can Kill You", "author": "RoyalMarz", "text": "I was just about ready to clock the lady in line when I heard it. Something I'd never heard before. Something that drilled a hole right through me, like a sword, or a harpoon, or the giant tusk from a narwhal—select your weapon of choice. Something that set me over the edge. And boy did it slice through me like I was a good ol' Christmas ham. [M/F] [Post-SOF]"}, {"title": "Maximum Ride: The Angel Experiment (From Fangs POV)", "author": "reviews", "text": "This is the 1st book of the Maximum Ride series except… from Fang's POV! Or what I would think his POV would be if it was. Rated T. I DO NOT OWN THE BOOK, CHARACTERS, OR ANYTHING SUCH AS POSSIBLE DIALOGUE THAT IS FOUND IN THE BOOK. CREDIT GOES TO THE AUTHOR JAMES PATTERSON!"}, {"title": "If We Hold On Together", "author": "valxra", "text": "Max finally realizes and accepts the importance of her destiny to save the world"}]