[{"title": "The Eclipse", "author": "I dont want a name 51", "text": "A young Spartan must heed the call of the gods, abandoning his brothers in arms before the Battle of Thermopylae. What gods could be calling the warrior, and who would want a son of Poseidon? As he left the awaiting massacre, Perseus realizes that fate has a lot more in store for him than be imagined. His name will never make the history books, but his actions will."}, {"title": "TheDemigods: A YouTuber Fanfic", "author": "Orca2Whale", "text": "Not an AU. Come see what happens when one of Leo's \"amazing ideas\" sends the 7 and friends into the word of the Internet, while trying to keep mortals from finding out about their heritage! T for light cussing. Runs likes a Youtube channel, questions and comments welcome!"}, {"title": "Love Through Pain", "author": "Wisdom and Sea", "text": "My name is Annabeth Chase. I'm 17 and a senior at Goode Highschool. I had the perfect life. Until I didn't. I'm going to tell you about the day my world shattered, and how the least likely person helped me pick up the pieces."}, {"title": "I Was Forced To Be A Hero", "author": "loseyourself99", "text": "Maximus and Cassandra are twin children of Artemis. They try to handle their lives as best as they can but Max has no motivation to help save the world. On top of that they're not the biggest fans of their mother. Can Max and Cassandra help save the world or will the rejection of their mother cause a problem. (This story follows the events of the books loosely)"}, {"title": "The Gift of the Gods", "author": "Creator2005", "text": "Arina is just an average twelve-year-old that has ADHD but has never met her father. Sound familiar? Join Arina as she uncovers her true parentage and helps her friends defeat monsters while a prophecy looms over them. (A/N: This story is from Arina's P.O.V.) (Disclaimer: I own nothing but my OCs and alterations of the story)"}, {"title": "Chiron's Campfire Tales", "author": "Orca2Whale", "text": "20 years in the future, Percy's generation has left camp, and a lot has changed. But legends and heroes are still a thing, and Chiron wants to keep that alive. K . May have mild cussing though I try not to."}, {"title": "DJ of angels and demons", "author": "Trials of Dawn", "text": "When the daughter of TWO Japanese gods shows up at Camp Half-Blood, you know there will be action! This is my own oc, so don't kill me. It is AFTER the Heroes of Olympus, just so you can have the time frame. Please put ship ideas in reviews!"}, {"title": "Healing a Broken Angel", "author": "CrimsonSayian12", "text": "Eons ago, before the Present time, there was a prophecy. One that would announce the deaths of the Olympians at the hand of a God Killer. There was someone said to stop this God Killer, a powerful half-blood hero. But what if he didn't want to save the Olympians, what if he knew how they acted like and what if he only thing cared about was keeping what he had, safe from harm"}, {"title": "Forgotten ( Percy Jackson )", "author": "Colette1112", "text": "\"Zeus ! \" shouted a very angry 5000 year old deity. Nope she isn't Hera angry at Zeus for cheating on her. She is the eldest daughter of Kronos and Rhea. True ruler of Olympus. Read on to find out. ( PS. I have no idea what is rating k )"}, {"title": "I may fail you (but it doesn't mean that I won't try)", "author": "ArtemisApollo97", "text": "Percy, Annabeth, and the variations they explore in myths. [Gender AU – F/M, F/F, M/M]"}, {"title": "Trouble is not restricted to Paradise", "author": "Ultimatedude80", "text": "Leo had only just left. Calypso had decided to potter around, take her mind off things. Oh, she did miss that idiot. But little did she know that trouble came with the tide..."}, {"title": "Percy Jackson the hold on the guardian", "author": "luna0senpai", "text": "Percy is in grief"}, {"title": "What Am I To You", "author": "brown95008", "text": "A NEW Character?..."}, {"title": "Percy Jackson is a baller", "author": "Average Canadian", "text": "Percy Jackson just wants play basketball and a take a break from the gods. However, he can never be left alone. When his high school life and and half blood life clash together, he can no longer be a bystander."}, {"title": "Story Idea", "author": "Average Canadian", "text": "a post apocalypses percy Jackson story idea only read if your an writer or because this will mean nothing to non writers"}]