[{"title": "LANDLINE: Segundas Oportunidades", "author": "Redana Crisp", "text": "Bella sabe que su matrimonio está en problemas. Que lo ha estado por mucho tiempo. Una noche descubre una manera de comunicarse con el pasado e intenta arreglar su matrimonio antes de que siquiera comience. ¿Es eso lo que se supone que haga? ¿O Bella y Edward estarían mejor si nunca se hubiesen casado?"}, {"title": "Run to You", "author": "SehunsBae37", "text": "Bella has not been feeling complete with the absence of her best friend, and she can't bring herself to even act happy with her approaching wedding. She misses Jacob terribly but doesn't know what to do about it. However, Bella finally decides to listen to what her heart tells her and go after what it truly wants, and that means going after Jacob."}, {"title": "A Christmas Wish", "author": "airedalegirl1", "text": "All of Bella's dreams come to nothing when she feels that she has lost everything that matters. She's alone even though surrounded by family and contemplating ending it all when a Christmas wish comes true. J/B"}, {"title": "Equinox", "author": "Seph Meadowes", "text": "Angela Weber was the pastor's daughter, the girl next door, and everybody's friend. She was not the object of romantic interest or the middle of a love triangle. Fate had other plans. [No Bella.]"}, {"title": "Like Cats and Dogs", "author": "Pop-X-Tart", "text": "I could feel his burning, angry stare from across the bonfire. Despite the peaceful co-existence of both types of shape-shifters around us, he continued to glare. \"It had to be you.\" He spat. After a long, lazy minute, I dully looked up. It looked like his lip pulled up in a snarl at my patronizing gaze. \"It had to be you...\" I repeated."}, {"title": "Chemo, Amnesia, and Stilettos", "author": "Moonrise123", "text": "Bella Dwyer disappeared after her boyfriend was diagnosed with a deadly brain tumor. Edward Cullen is thrilled when she is found safe a year later in La Push. There's just one problem, she doesn't remember him and doesn't want to return to Forks. Will Bella remember her past or choose a new life with the Black family?"}, {"title": "DEATHSPELL - Does it start okay?", "author": "Mizzy25", "text": "Orphan Bella is found by the Cullens who claim to be her long lost relatives. Namely bad boy Edward, who seems determined to keep his distance. Once at Thorncrest Manor she must uncover the truth behind their motives, the ghost begging her to leave, the story of creatures and ethereal beings at war with one another, over her?"}, {"title": "Never Stop Dreaming", "author": "Trendie", "text": "La famille Lahote est composée de Kimberley qui est lycéenne, de Paul qui lui est fiancé, et d'Ashley qui est perdue entre les deux. Venez donc lire leur histoire ..."}, {"title": "Timeless", "author": "ButterflyMiko", "text": "The Hikawa sisters are Daughters of the Moon, Quiluete priestess of ancient times, chosen to protect an ancient secret. A curse hangs heavy between La Push and Forks, looming over the woods like a fog. They must stop it from coming to past, or face the war and carnage it brings upon their world."}, {"title": "Shattered", "author": "ButterflyMiko", "text": "Jacob's shattered after losing Bella. He gets put on guard duty to a sacred weapon. When a woman comes to claim it, being near her begins to sooth his wounded heart."}, {"title": "The Lone Wolf", "author": "flora swan", "text": "Bella was kidnapped by the Volturi when she was four years old, she grown up with them and she phases into a wolf. One day she escapes and heads back to her home and to her big brother. She gets imprinted on by one of the pack, will she accept the imprint"}, {"title": "Werewolves together (Jacob Pov)", "author": "reviews", "text": "you see my feelings for you"}, {"title": "Love is Flower Like (Paul Lahote LS)", "author": "NotDeadYet16", "text": "Like a flower, Meadow Black only needed the essentials. She didn't need the extra stuff that came with extra things. She also didn't like wasting anything. Time, breaths, words. She was reserved to the public and only exerted extra effort when it came to her family. Paul Lahote has never met anyone like Meadow. How was he supposed to get her to like him, or even talk to him?"}, {"title": "Blood on the Moon", "author": "patricia51", "text": "Bree Cullen and Seth Clearwater are happily enrolled in college together and dating. When a series of grisly murders draws too much attention to the possibility of vampires and werewolves they find themselves looking into the crimes for their own safety. And then figures from Bree's past show up and seem determined to pull her back to her old life. Sequel to my story \"Asylum\"."}, {"title": "Bella's marathon:never stop running", "author": "Cmcgint1", "text": "It's not that Jared cared about the girl who ran with vampires, However, The more he looked at her the more he thought she really is beautiful."}]