[{"title": "Blazing Lilies", "author": "TheShadowedWarrior", "text": "An inch can make all the difference in the world. When Moonflower survives the raid against WindClan, Bluepaw's life changes in ways she never expected. Suddenly, she has a father who actually pays attention to her and a new baby sister who's as sweet as a flower and as wild as a newleaf storm."}, {"title": "Three Clans", "author": "Duskspiral", "text": "In the midst of a battle between clans sits Fadingpaw, a young apprentice who's generally uninterested in anything other than having fun. But can she really learn to be a proper warrior before things get rough and the clans start falling apart? (OC SUBMIT)"}, {"title": "Warriors: The New Era", "author": "Jayfeathers Friend", "text": "(Sequel to Warriors High) The Moonstone is gone. Jay's Wing and Rock have reconciled. Jayfeather and Half Moon are reunited. Forrestlake is Thriving. Everything is perfect. But after a shocking discovery, the now University Students must return to the fight. New Threats, New enemies, and a Triumvirate of seemingly equal power to The Three. And that's not even all of it..."}, {"title": "Flowerwish's Heart", "author": "poppyfrost123", "text": "Flowerwish is a young warrior and desperate for love. What will she do when her love decides he's almost ready to take a mate? Another cat stands in her way, lowering her chances of the one dream she's always had."}, {"title": "Daystar's prophecy", "author": "Oceanpaw", "text": "Set long after Bramblestar has died, around the lake a new prophecy has arisen; but every cat has to start somewhere. my first fanfic - ever, please don't judge."}, {"title": "On Thin Ice", "author": "poppyfrost123", "text": "A deadly winter has struck the Clans. Sickness is spreading rapidly through the Clans. The Clans are starving. Well, almost all of them. On Clan has managed to thrive in the cold and the rest are jealous and try to take prey for themselves. What will a warrior do when she is tested? Fighting, fish, and flirts make its way into this story of IceClan and its warriors."}, {"title": "Embers and Ashes", "author": "Wolfcreations20", "text": "In Sootpaw's and Flarepaw's world, hierarchy is everything. Rank determines how easy or how difficult your life in the clan plays out. One is a Commoner- a low rank- one is destined to become a Grand Royal- the highest rank. Their worlds are the same-connected- yet, entirely different. The two struggle in their own ways and live... *Rest inside* (Updates are now every other SUNDAY)"}, {"title": "Falling Feathers", "author": "entity9silvergen", "text": "Jayfeather knows he's going to die. StarClan has warned him and he knows there is no use denying it. Now all he wants to do is make a few last memories with the cats he cares for... Only there is one problem. The cats closest to him are gone and his home is filled with strangers. But there's one cat Jayfeather's always been too afraid to face. His father."}, {"title": "WARRIORS POETRY - EVERY KIND", "author": "Silver Speaker", "text": "Enjoy poems about your favorite warrior cats! Anything from songs to rap battles to flat-out poems. Enjoy!"}, {"title": "Warriors High", "author": "KT-FeatherSage", "text": "Welcome to Warriors High! The place to learn and play, though do you really trust that? No. No one is safe, three gangs lie in wait of their victims, and people are starting to disappear. And they want to kill. Nowhere is safe. But yet everything is fine, we have the couples, the good grades, everything for a normal life. Confused? Cool! Jump right in! Next stop, Warriors High!"}, {"title": "Burning Blue (Remake)", "author": "Crimson.Raspberry", "text": "Bluefur is a newly made warrior of ThunderClan. After a strange dream when she was an apprentice, she had been deeply troubled. But one day she finds a mysterious ginger tom wondering the border of ThunderClan's territory, and everything changes. (Remake of Burning Blue)"}, {"title": "TB AU - The Great Journey: Midnight", "author": "Twilidramon", "text": "The Clans have lived in seasons of peace and harmony since the battle with BloodClan - but now, something is wrong in the forest. As the daughter of her Clan's greatest enemy, Mistyfoot struggles to find her place in ThunderClan. Can Mistyfoot overcome her personal struggles in order to safeguard the Clans and cats she loves? Rated T for safety."}, {"title": "PLEASEALLOWMETOWALKAWAY", "author": "reviews", "text": "The figure playing Firestar doesn't want to be the hero anymore. This is his call for help. [Parody of \"Die Hamletmaschine\" by Heiner Müller] [Composed in around 15 minutes]"}, {"title": "Warriors my version (Firestar is the leader not Bramblestar)", "author": "Montez376 Jackie-May", "text": "What if there was different main characters in the future? What if there was a different point of view? (Of a different character of course.) come and see by reading this story!"}, {"title": "Young Hearts", "author": "TytoNoctua", "text": "The last to see his mother alive, to watch his siblings abuse, to fall in love with another. Was this his destiny? Neglected by her clan, neglected by her family, to fall for another. Was this her destiny? Useless feeling overwhelmed him, nothing to be proud of, false hope for the future. Was this his destiny? He saw pain in her eyes, she saw his eyes soften. Was it their destiny?"}]